In [32]:
import pyspark
from pyspark.sql.functions import *
from pyspark.sql.window import Window
from pyspark.sql import functions as F
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("Reading_csv").getOrCreate()

In [33]:
df_1 = spark.read.csv(r"C:\Users\tharu\OneDrive\Documents\Employes.csv",inferSchema=True,header=True)

In [34]:
df_1.show()

+-----+------+-------+----+---------+----+----+------+
|EMPNO| ENAME|    JOB| MGR| HIREDATE| SAL|COMM|DEPTNO|
+-----+------+-------+----+---------+----+----+------+
|  728| SMITH|  CLERK| 762|12-Mar-23|3000|NULL|    30|
|  718| ALLEN|SALSMAN| 745|15-Dec-22|2500|NULL|    20|
|  762|   SAM|MANAGER| 753|26-Sep-22|3500| 500|    20|
|  738|MARTIN|ANALYST| 728|10-Feb-21|4000|NULL|    30|
|  769| BLACK|  CLERK| 762|25-Dec-22|2000|NULL|    10|
|  728|  KING|MANAGER|NULL|16-Mar-21|5000|1000|    30|
|  796|TURNER|SALSMAN| 745|25-Jul-22|3500| 250|    20|
|  785| SCOTT|  CLERK| 762|03-Oct-21|3000|NULL|    30|
|  753| ADAMS|ANALYST| 728|24-Nov-23|3500|NULL|    10|
|  734|  FORD|  CLERK| 762|28-Oct-22|2500|NULL|    10|
|  745|MILLER|MANAGER| 728|18-Jan-22|3500| 700|    20|
+-----+------+-------+----+---------+----+----+------+

In [35]:
df_2 = spark.read.csv(r"C:\Users\tharu\OneDrive\Documents\Department.csv",inferSchema=True,header=True)

In [36]:
df_2.show()

+------+------+------------+
|DEPTNO| DNAME|    LOCATION|
+------+------+------------+
|    30| SMITH|    NEW YORK|
|    20| ALLEN|     CHICAGO|
|    20|   SAM| LOS ANGELES|
|    30|MARTIN|      DALLAS|
|    10| BLACK|SAN FRANSICO|
|    30|  KING|     CHICAGO|
|    20|TURNER|    NEW YORK|
|    30| SCOTT|      DALLAS|
|    10| ADAMS|     CHICAGO|
|    10|  FORD|    NEW YORK|
|    20|MILLER| LOS ANGELES|
+------+------+------------+

In [37]:
inner_join = df_1.join(df_2, df_1.ENAME == df_2.DNAME, "inner")
print("INNER JOIN:")
inner_join.show()

INNER JOIN:
+-----+------+-------+----+---------+----+----+------+------+------+------------+
|EMPNO| ENAME|    JOB| MGR| HIREDATE| SAL|COMM|DEPTNO|DEPTNO| DNAME|    LOCATION|
+-----+------+-------+----+---------+----+----+------+------+------+------------+
|  728| SMITH|  CLERK| 762|12-Mar-23|3000|NULL|    30|    30| SMITH|    NEW YORK|
|  718| ALLEN|SALSMAN| 745|15-Dec-22|2500|NULL|    20|    20| ALLEN|     CHICAGO|
|  762|   SAM|MANAGER| 753|26-Sep-22|3500| 500|    20|    20|   SAM| LOS ANGELES|
|  738|MARTIN|ANALYST| 728|10-Feb-21|4000|NULL|    30|    30|MARTIN|      DALLAS|
|  769| BLACK|  CLERK| 762|25-Dec-22|2000|NULL|    10|    10| BLACK|SAN FRANSICO|
|  728|  KING|MANAGER|NULL|16-Mar-21|5000|1000|    30|    30|  KING|     CHICAGO|
|  796|TURNER|SALSMAN| 745|25-Jul-22|3500| 250|    20|    20|TURNER|    NEW YORK|
|  785| SCOTT|  CLERK| 762|03-Oct-21|3000|NULL|    30|    30| SCOTT|      DALLAS|
|  753| ADAMS|ANALYST| 728|24-Nov-23|3500|NULL|    10|    10| ADAMS|     CHICAGO|
|  734|  FORD|  CLERK| 762|28-Oct-22|2500|NULL|    10|    10|  FORD|    NEW YORK|
|  745|MILLER|MANAGER| 728|18-Jan-22|3500| 700|    20|    20|MILLER| LOS ANGELES|
+-----+------+-------+----+---------+----+----+------+------+------+------------+

In [38]:
full_outer_join = df_1.join(df_2, df_1.ENAME == df_2.DNAME, "outer")
print("FULL OUTER JOIN:")
inner_join.show()

FULL OUTER JOIN:
+-----+------+-------+----+---------+----+----+------+------+------+------------+
|EMPNO| ENAME|    JOB| MGR| HIREDATE| SAL|COMM|DEPTNO|DEPTNO| DNAME|    LOCATION|
+-----+------+-------+----+---------+----+----+------+------+------+------------+
|  728| SMITH|  CLERK| 762|12-Mar-23|3000|NULL|    30|    30| SMITH|    NEW YORK|
|  718| ALLEN|SALSMAN| 745|15-Dec-22|2500|NULL|    20|    20| ALLEN|     CHICAGO|
|  762|   SAM|MANAGER| 753|26-Sep-22|3500| 500|    20|    20|   SAM| LOS ANGELES|
|  738|MARTIN|ANALYST| 728|10-Feb-21|4000|NULL|    30|    30|MARTIN|      DALLAS|
|  769| BLACK|  CLERK| 762|25-Dec-22|2000|NULL|    10|    10| BLACK|SAN FRANSICO|
|  728|  KING|MANAGER|NULL|16-Mar-21|5000|1000|    30|    30|  KING|     CHICAGO|
|  796|TURNER|SALSMAN| 745|25-Jul-22|3500| 250|    20|    20|TURNER|    NEW YORK|
|  785| SCOTT|  CLERK| 762|03-Oct-21|3000|NULL|    30|    30| SCOTT|      DALLAS|
|  753| ADAMS|ANALYST| 728|24-Nov-23|3500|NULL|    10|    10| ADAMS|     CHICAGO|
|  734|  FORD|  CLERK| 762|28-Oct-22|2500|NULL|    10|    10|  FORD|    NEW YORK|
|  745|MILLER|MANAGER| 728|18-Jan-22|3500| 700|    20|    20|MILLER| LOS ANGELES|
+-----+------+-------+----+---------+----+----+------+------+------+------------+

In [39]:
df_1.printSchema

In [40]:
df_2.printSchema

In [41]:
a = df_1.columns
b = df_2.columns
for i in range(len(a)):
    #print(a[i])
    for j in range(len(b)):
        print(b[j], end=' ')
        #print(a[i],b[j], end=' ')
    print()

DEPTNO DNAME LOCATION
DEPTNO DNAME LOCATION
DEPTNO DNAME LOCATION
DEPTNO DNAME LOCATION
DEPTNO DNAME LOCATION
DEPTNO DNAME LOCATION
DEPTNO DNAME LOCATION
DEPTNO DNAME LOCATION

# Select specific columns

In [42]:
column_name = 'ENAME'
selected_column = df_1.select(column_name)
column_values = selected_column.rdd.map(lambda x: x[0]).collect()
for value in column_values:
    print(value)

SMITH
ALLEN
SAM
MARTIN
BLACK
KING
TURNER
SCOTT
ADAMS
FORD
MILLER

# Rank

In [43]:
df_1.show()

+-----+------+-------+----+---------+----+----+------+
|EMPNO| ENAME|    JOB| MGR| HIREDATE| SAL|COMM|DEPTNO|
+-----+------+-------+----+---------+----+----+------+
|  728| SMITH|  CLERK| 762|12-Mar-23|3000|NULL|    30|
|  718| ALLEN|SALSMAN| 745|15-Dec-22|2500|NULL|    20|
|  762|   SAM|MANAGER| 753|26-Sep-22|3500| 500|    20|
|  738|MARTIN|ANALYST| 728|10-Feb-21|4000|NULL|    30|
|  769| BLACK|  CLERK| 762|25-Dec-22|2000|NULL|    10|
|  728|  KING|MANAGER|NULL|16-Mar-21|5000|1000|    30|
|  796|TURNER|SALSMAN| 745|25-Jul-22|3500| 250|    20|
|  785| SCOTT|  CLERK| 762|03-Oct-21|3000|NULL|    30|
|  753| ADAMS|ANALYST| 728|24-Nov-23|3500|NULL|    10|
|  734|  FORD|  CLERK| 762|28-Oct-22|2500|NULL|    10|
|  745|MILLER|MANAGER| 728|18-Jan-22|3500| 700|    20|
+-----+------+-------+----+---------+----+----+------+

In [44]:

window_spec = Window.partitionBy("DEPTNO").orderBy("SAL")
rank_salary_by_dept = F.rank().over(window_spec)
df_ranked_salary = df_1.withColumn("RANK", rank_salary_by_dept)
df_ranked_salary.show()

+-----+------+-------+----+---------+----+----+------+----+
|EMPNO| ENAME|    JOB| MGR| HIREDATE| SAL|COMM|DEPTNO|RANK|
+-----+------+-------+----+---------+----+----+------+----+
|  769| BLACK|  CLERK| 762|25-Dec-22|2000|NULL|    10|   1|
|  734|  FORD|  CLERK| 762|28-Oct-22|2500|NULL|    10|   2|
|  753| ADAMS|ANALYST| 728|24-Nov-23|3500|NULL|    10|   3|
|  718| ALLEN|SALSMAN| 745|15-Dec-22|2500|NULL|    20|   1|
|  762|   SAM|MANAGER| 753|26-Sep-22|3500| 500|    20|   2|
|  796|TURNER|SALSMAN| 745|25-Jul-22|3500| 250|    20|   2|
|  745|MILLER|MANAGER| 728|18-Jan-22|3500| 700|    20|   2|
|  728| SMITH|  CLERK| 762|12-Mar-23|3000|NULL|    30|   1|
|  785| SCOTT|  CLERK| 762|03-Oct-21|3000|NULL|    30|   1|
|  738|MARTIN|ANALYST| 728|10-Feb-21|4000|NULL|    30|   3|
|  728|  KING|MANAGER|NULL|16-Mar-21|5000|1000|    30|   4|
+-----+------+-------+----+---------+----+----+------+----+


# Dense Rank

In [45]:
# Define the window specification
window_spec = Window.partitionBy("DEPTNO").orderBy("SAL")

dense_rank_salary_by_dept = F.dense_rank().over(window_spec)
df_dense_ranked_salary = df_1.withColumn("DENSE_RANK", dense_rank_salary_by_dept)
print("DataFrame with Dense Rank:")
df_dense_ranked_salary.show()

DataFrame with Dense Rank:
+-----+------+-------+----+---------+----+----+------+----------+
|EMPNO| ENAME|    JOB| MGR| HIREDATE| SAL|COMM|DEPTNO|DENSE_RANK|
+-----+------+-------+----+---------+----+----+------+----------+
|  769| BLACK|  CLERK| 762|25-Dec-22|2000|NULL|    10|         1|
|  734|  FORD|  CLERK| 762|28-Oct-22|2500|NULL|    10|         2|
|  753| ADAMS|ANALYST| 728|24-Nov-23|3500|NULL|    10|         3|
|  718| ALLEN|SALSMAN| 745|15-Dec-22|2500|NULL|    20|         1|
|  762|   SAM|MANAGER| 753|26-Sep-22|3500| 500|    20|         2|
|  796|TURNER|SALSMAN| 745|25-Jul-22|3500| 250|    20|         2|
|  745|MILLER|MANAGER| 728|18-Jan-22|3500| 700|    20|         2|
|  728| SMITH|  CLERK| 762|12-Mar-23|3000|NULL|    30|         1|
|  785| SCOTT|  CLERK| 762|03-Oct-21|3000|NULL|    30|         1|
|  738|MARTIN|ANALYST| 728|10-Feb-21|4000|NULL|    30|         2|
|  728|  KING|MANAGER|NULL|16-Mar-21|5000|1000|    30|         3|
+-----+------+-------+----+---------+----+----+------+----------+

# Row Number

In [46]:

row_number_salary_by_dept = F.row_number().over(window_spec)
df_row_numbered_salary = df_1.withColumn("ROW_NUMBER", row_number_salary_by_dept)
print("DataFrame with Row Number:")
df_row_numbered_salary.show()

DataFrame with Row Number:
+-----+------+-------+----+---------+----+----+------+----------+
|EMPNO| ENAME|    JOB| MGR| HIREDATE| SAL|COMM|DEPTNO|ROW_NUMBER|
+-----+------+-------+----+---------+----+----+------+----------+
|  769| BLACK|  CLERK| 762|25-Dec-22|2000|NULL|    10|         1|
|  734|  FORD|  CLERK| 762|28-Oct-22|2500|NULL|    10|         2|
|  753| ADAMS|ANALYST| 728|24-Nov-23|3500|NULL|    10|         3|
|  718| ALLEN|SALSMAN| 745|15-Dec-22|2500|NULL|    20|         1|
|  762|   SAM|MANAGER| 753|26-Sep-22|3500| 500|    20|         2|
|  796|TURNER|SALSMAN| 745|25-Jul-22|3500| 250|    20|         3|
|  745|MILLER|MANAGER| 728|18-Jan-22|3500| 700|    20|         4|
|  728| SMITH|  CLERK| 762|12-Mar-23|3000|NULL|    30|         1|
|  785| SCOTT|  CLERK| 762|03-Oct-21|3000|NULL|    30|         2|
|  738|MARTIN|ANALYST| 728|10-Feb-21|4000|NULL|    30|         3|
|  728|  KING|MANAGER|NULL|16-Mar-21|5000|1000|    30|         4|
+-----+------+-------+----+---------+----+----+------+----------+

# Filter data based on a condition

In [47]:

#filtered_data = df_1.filter(df_1["COMM"].isnotnull() )
#filtered_data.show()
filtered_data = df_1.filter(df_1["COMM"].isNotNull())
filtered_data.show()

+-----+------+-------+----+---------+----+----+------+
|EMPNO| ENAME|    JOB| MGR| HIREDATE| SAL|COMM|DEPTNO|
+-----+------+-------+----+---------+----+----+------+
|  762|   SAM|MANAGER| 753|26-Sep-22|3500| 500|    20|
|  728|  KING|MANAGER|NULL|16-Mar-21|5000|1000|    30|
|  796|TURNER|SALSMAN| 745|25-Jul-22|3500| 250|    20|
|  745|MILLER|MANAGER| 728|18-Jan-22|3500| 700|    20|
+-----+------+-------+----+---------+----+----+------+

# Group by department and calculate the average salary

In [48]:

avg_salary_by_dept = df_1.groupBy("DEPTNO").agg(avg("SAL").alias("AVG_SALARY"))
avg_salary_by_dept.show()

+------+------------------+
|DEPTNO|        AVG_SALARY|
+------+------------------+
|    20|            3250.0|
|    10|2666.6666666666665|
|    30|            3750.0|
+------+------------------+

# Sort the DataFrame based on a column

In [49]:

sorted_df = df_1.orderBy("SAL", ascending=False)
sorted_df.show()

+-----+------+-------+----+---------+----+----+------+
|EMPNO| ENAME|    JOB| MGR| HIREDATE| SAL|COMM|DEPTNO|
+-----+------+-------+----+---------+----+----+------+
|  728|  KING|MANAGER|NULL|16-Mar-21|5000|1000|    30|
|  738|MARTIN|ANALYST| 728|10-Feb-21|4000|NULL|    30|
|  762|   SAM|MANAGER| 753|26-Sep-22|3500| 500|    20|
|  796|TURNER|SALSMAN| 745|25-Jul-22|3500| 250|    20|
|  753| ADAMS|ANALYST| 728|24-Nov-23|3500|NULL|    10|
|  745|MILLER|MANAGER| 728|18-Jan-22|3500| 700|    20|
|  728| SMITH|  CLERK| 762|12-Mar-23|3000|NULL|    30|
|  785| SCOTT|  CLERK| 762|03-Oct-21|3000|NULL|    30|
|  718| ALLEN|SALSMAN| 745|15-Dec-22|2500|NULL|    20|
|  734|  FORD|  CLERK| 762|28-Oct-22|2500|NULL|    10|
|  769| BLACK|  CLERK| 762|25-Dec-22|2000|NULL|    10|
+-----+------+-------+----+---------+----+----+------+

#  Add a new column with a calculated value

In [50]:

df_with_bonus = df_1.withColumn("TOTAL_SALARY", col("SAL") + col("COMM"))
df_with_bonus.show()

+-----+------+-------+----+---------+----+----+------+------------+
|EMPNO| ENAME|    JOB| MGR| HIREDATE| SAL|COMM|DEPTNO|TOTAL_SALARY|
+-----+------+-------+----+---------+----+----+------+------------+
|  728| SMITH|  CLERK| 762|12-Mar-23|3000|NULL|    30|        NULL|
|  718| ALLEN|SALSMAN| 745|15-Dec-22|2500|NULL|    20|        NULL|
|  762|   SAM|MANAGER| 753|26-Sep-22|3500| 500|    20|        4000|
|  738|MARTIN|ANALYST| 728|10-Feb-21|4000|NULL|    30|        NULL|
|  769| BLACK|  CLERK| 762|25-Dec-22|2000|NULL|    10|        NULL|
|  728|  KING|MANAGER|NULL|16-Mar-21|5000|1000|    30|        6000|
|  796|TURNER|SALSMAN| 745|25-Jul-22|3500| 250|    20|        3750|
|  785| SCOTT|  CLERK| 762|03-Oct-21|3000|NULL|    30|        NULL|
|  753| ADAMS|ANALYST| 728|24-Nov-23|3500|NULL|    10|        NULL|
|  734|  FORD|  CLERK| 762|28-Oct-22|2500|NULL|    10|        NULL|
|  745|MILLER|MANAGER| 728|18-Jan-22|3500| 700|    20|        4200|
+-----+------+-------+----+---------+----+----+------+------------+

#  Rename columns

In [51]:

df_renamed = df_1.withColumnRenamed("EMPNO", "EmployeeNumber")
df_renamed.show()

+--------------+------+-------+----+---------+----+----+------+
|EmployeeNumber| ENAME|    JOB| MGR| HIREDATE| SAL|COMM|DEPTNO|
+--------------+------+-------+----+---------+----+----+------+
|           728| SMITH|  CLERK| 762|12-Mar-23|3000|NULL|    30|
|           718| ALLEN|SALSMAN| 745|15-Dec-22|2500|NULL|    20|
|           762|   SAM|MANAGER| 753|26-Sep-22|3500| 500|    20|
|           738|MARTIN|ANALYST| 728|10-Feb-21|4000|NULL|    30|
|           769| BLACK|  CLERK| 762|25-Dec-22|2000|NULL|    10|
|           728|  KING|MANAGER|NULL|16-Mar-21|5000|1000|    30|
|           796|TURNER|SALSMAN| 745|25-Jul-22|3500| 250|    20|
|           785| SCOTT|  CLERK| 762|03-Oct-21|3000|NULL|    30|
|           753| ADAMS|ANALYST| 728|24-Nov-23|3500|NULL|    10|
|           734|  FORD|  CLERK| 762|28-Oct-22|2500|NULL|    10|
|           745|MILLER|MANAGER| 728|18-Jan-22|3500| 700|    20|
+--------------+------+-------+----+---------+----+----+------+

#  Drop columns

In [52]:

df_without_comm = df_1.drop("COMM")
df_without_comm.show()

+-----+------+-------+----+---------+----+------+
|EMPNO| ENAME|    JOB| MGR| HIREDATE| SAL|DEPTNO|
+-----+------+-------+----+---------+----+------+
|  728| SMITH|  CLERK| 762|12-Mar-23|3000|    30|
|  718| ALLEN|SALSMAN| 745|15-Dec-22|2500|    20|
|  762|   SAM|MANAGER| 753|26-Sep-22|3500|    20|
|  738|MARTIN|ANALYST| 728|10-Feb-21|4000|    30|
|  769| BLACK|  CLERK| 762|25-Dec-22|2000|    10|
|  728|  KING|MANAGER|NULL|16-Mar-21|5000|    30|
|  796|TURNER|SALSMAN| 745|25-Jul-22|3500|    20|
|  785| SCOTT|  CLERK| 762|03-Oct-21|3000|    30|
|  753| ADAMS|ANALYST| 728|24-Nov-23|3500|    10|
|  734|  FORD|  CLERK| 762|28-Oct-22|2500|    10|
|  745|MILLER|MANAGER| 728|18-Jan-22|3500|    20|
+-----+------+-------+----+---------+----+------+

In [53]:
df = df_1.na.drop()
df.show()

+-----+------+-------+---+---------+----+----+------+
|EMPNO| ENAME|    JOB|MGR| HIREDATE| SAL|COMM|DEPTNO|
+-----+------+-------+---+---------+----+----+------+
|  762|   SAM|MANAGER|753|26-Sep-22|3500| 500|    20|
|  796|TURNER|SALSMAN|745|25-Jul-22|3500| 250|    20|
|  745|MILLER|MANAGER|728|18-Jan-22|3500| 700|    20|
+-----+------+-------+---+---------+----+----+------+

#  Describe statistics of numerical columns

In [54]:

df_1.select(["SAL", "COMM"]).describe().show()

+-------+------------------+------------------+
|summary|               SAL|              COMM|
+-------+------------------+------------------+
|  count|                11|                 4|
|   mean|3272.7272727272725|             612.5|
| stddev| 817.4238913695991|317.21443851123803|
|    min|              2000|               250|
|    max|              5000|              1000|
+-------+------------------+------------------+

In [55]:
from pyspark.sql import functions as F

df_1.select([F.min("SAL"), F.min("ENAME")]).show()
df_1.select([F.max("SAL"), F.max("ENAME")]).show()

+--------+----------+
|min(SAL)|min(ENAME)|
+--------+----------+
|    2000|     ADAMS|
+--------+----------+

+--------+----------+
|max(SAL)|max(ENAME)|
+--------+----------+
|    5000|    TURNER|
+--------+----------+

In [56]:
df_1.show(5)

+-----+------+-------+---+---------+----+----+------+
|EMPNO| ENAME|    JOB|MGR| HIREDATE| SAL|COMM|DEPTNO|
+-----+------+-------+---+---------+----+----+------+
|  728| SMITH|  CLERK|762|12-Mar-23|3000|NULL|    30|
|  718| ALLEN|SALSMAN|745|15-Dec-22|2500|NULL|    20|
|  762|   SAM|MANAGER|753|26-Sep-22|3500| 500|    20|
|  738|MARTIN|ANALYST|728|10-Feb-21|4000|NULL|    30|
|  769| BLACK|  CLERK|762|25-Dec-22|2000|NULL|    10|
+-----+------+-------+---+---------+----+----+------+
only showing top 5 rows

In [57]:
df_1.select("EMPNO", "ENAME", "JOB").show()

+-----+------+-------+
|EMPNO| ENAME|    JOB|
+-----+------+-------+
|  728| SMITH|  CLERK|
|  718| ALLEN|SALSMAN|
|  762|   SAM|MANAGER|
|  738|MARTIN|ANALYST|
|  769| BLACK|  CLERK|
|  728|  KING|MANAGER|
|  796|TURNER|SALSMAN|
|  785| SCOTT|  CLERK|
|  753| ADAMS|ANALYST|
|  734|  FORD|  CLERK|
|  745|MILLER|MANAGER|
+-----+------+-------+

In [58]:
df_grouped = df_1.groupBy("DEPTNO").agg({"SAL": "avg", "COMM": "sum"})
df_grouped.show()

+------+---------+------------------+
|DEPTNO|sum(COMM)|          avg(SAL)|
+------+---------+------------------+
|    20|     1450|            3250.0|
|    10|     NULL|2666.6666666666665|
|    30|     1000|            3750.0|
+------+---------+------------------+

In [59]:
df_sorted = df_1.orderBy("SAL", ascending=False)
df_sorted.show()

+-----+------+-------+----+---------+----+----+------+
|EMPNO| ENAME|    JOB| MGR| HIREDATE| SAL|COMM|DEPTNO|
+-----+------+-------+----+---------+----+----+------+
|  728|  KING|MANAGER|NULL|16-Mar-21|5000|1000|    30|
|  738|MARTIN|ANALYST| 728|10-Feb-21|4000|NULL|    30|
|  762|   SAM|MANAGER| 753|26-Sep-22|3500| 500|    20|
|  796|TURNER|SALSMAN| 745|25-Jul-22|3500| 250|    20|
|  753| ADAMS|ANALYST| 728|24-Nov-23|3500|NULL|    10|
|  745|MILLER|MANAGER| 728|18-Jan-22|3500| 700|    20|
|  728| SMITH|  CLERK| 762|12-Mar-23|3000|NULL|    30|
|  785| SCOTT|  CLERK| 762|03-Oct-21|3000|NULL|    30|
|  718| ALLEN|SALSMAN| 745|15-Dec-22|2500|NULL|    20|
|  734|  FORD|  CLERK| 762|28-Oct-22|2500|NULL|    10|
|  769| BLACK|  CLERK| 762|25-Dec-22|2000|NULL|    10|
+-----+------+-------+----+---------+----+----+------+

In [60]:
df_with_bonus = df_1.withColumn("BONUS", F.col("SAL") * 0.1)
df_with_bonus.show()

+-----+------+-------+----+---------+----+----+------+-----+
|EMPNO| ENAME|    JOB| MGR| HIREDATE| SAL|COMM|DEPTNO|BONUS|
+-----+------+-------+----+---------+----+----+------+-----+
|  728| SMITH|  CLERK| 762|12-Mar-23|3000|NULL|    30|300.0|
|  718| ALLEN|SALSMAN| 745|15-Dec-22|2500|NULL|    20|250.0|
|  762|   SAM|MANAGER| 753|26-Sep-22|3500| 500|    20|350.0|
|  738|MARTIN|ANALYST| 728|10-Feb-21|4000|NULL|    30|400.0|
|  769| BLACK|  CLERK| 762|25-Dec-22|2000|NULL|    10|200.0|
|  728|  KING|MANAGER|NULL|16-Mar-21|5000|1000|    30|500.0|
|  796|TURNER|SALSMAN| 745|25-Jul-22|3500| 250|    20|350.0|
|  785| SCOTT|  CLERK| 762|03-Oct-21|3000|NULL|    30|300.0|
|  753| ADAMS|ANALYST| 728|24-Nov-23|3500|NULL|    10|350.0|
|  734|  FORD|  CLERK| 762|28-Oct-22|2500|NULL|    10|250.0|
|  745|MILLER|MANAGER| 728|18-Jan-22|3500| 700|    20|350.0|
+-----+------+-------+----+---------+----+----+------+-----+

In [61]:
df_renamed = df_1.withColumnRenamed("EMPNO", "EmployeeID").withColumnRenamed("ENAME", "EmployeeName")
df_renamed.show()

+----------+------------+-------+----+---------+----+----+------+
|EmployeeID|EmployeeName|    JOB| MGR| HIREDATE| SAL|COMM|DEPTNO|
+----------+------------+-------+----+---------+----+----+------+
|       728|       SMITH|  CLERK| 762|12-Mar-23|3000|NULL|    30|
|       718|       ALLEN|SALSMAN| 745|15-Dec-22|2500|NULL|    20|
|       762|         SAM|MANAGER| 753|26-Sep-22|3500| 500|    20|
|       738|      MARTIN|ANALYST| 728|10-Feb-21|4000|NULL|    30|
|       769|       BLACK|  CLERK| 762|25-Dec-22|2000|NULL|    10|
|       728|        KING|MANAGER|NULL|16-Mar-21|5000|1000|    30|
|       796|      TURNER|SALSMAN| 745|25-Jul-22|3500| 250|    20|
|       785|       SCOTT|  CLERK| 762|03-Oct-21|3000|NULL|    30|
|       753|       ADAMS|ANALYST| 728|24-Nov-23|3500|NULL|    10|
|       734|        FORD|  CLERK| 762|28-Oct-22|2500|NULL|    10|
|       745|      MILLER|MANAGER| 728|18-Jan-22|3500| 700|    20|
+----------+------------+-------+----+---------+----+----+------+

In [62]:

joined_df = df_1.join(df_2, df_1["DEPTNO"] == df_2["DEPTNO"], "outer")
joined_df.show()

+-----+------+-------+---+---------+----+----+------+------+------+------------+
|EMPNO| ENAME|    JOB|MGR| HIREDATE| SAL|COMM|DEPTNO|DEPTNO| DNAME|    LOCATION|
+-----+------+-------+---+---------+----+----+------+------+------+------------+
|  769| BLACK|  CLERK|762|25-Dec-22|2000|NULL|    10|    10| BLACK|SAN FRANSICO|
|  769| BLACK|  CLERK|762|25-Dec-22|2000|NULL|    10|    10| ADAMS|     CHICAGO|
|  769| BLACK|  CLERK|762|25-Dec-22|2000|NULL|    10|    10|  FORD|    NEW YORK|
|  753| ADAMS|ANALYST|728|24-Nov-23|3500|NULL|    10|    10| BLACK|SAN FRANSICO|
|  753| ADAMS|ANALYST|728|24-Nov-23|3500|NULL|    10|    10| ADAMS|     CHICAGO|
|  753| ADAMS|ANALYST|728|24-Nov-23|3500|NULL|    10|    10|  FORD|    NEW YORK|
|  734|  FORD|  CLERK|762|28-Oct-22|2500|NULL|    10|    10| BLACK|SAN FRANSICO|
|  734|  FORD|  CLERK|762|28-Oct-22|2500|NULL|    10|    10| ADAMS|     CHICAGO|
|  734|  FORD|  CLERK|762|28-Oct-22|2500|NULL|    10|    10|  FORD|    NEW YORK|
|  718| ALLEN|SALSMAN|745|15-Dec-22|2500|NULL|    20|    20| ALLEN|     CHICAGO|
|  718| ALLEN|SALSMAN|745|15-Dec-22|2500|NULL|    20|    20|   SAM| LOS ANGELES|
|  718| ALLEN|SALSMAN|745|15-Dec-22|2500|NULL|    20|    20|TURNER|    NEW YORK|
|  718| ALLEN|SALSMAN|745|15-Dec-22|2500|NULL|    20|    20|MILLER| LOS ANGELES|
|  762|   SAM|MANAGER|753|26-Sep-22|3500| 500|    20|    20| ALLEN|     CHICAGO|
|  762|   SAM|MANAGER|753|26-Sep-22|3500| 500|    20|    20|   SAM| LOS ANGELES|
|  762|   SAM|MANAGER|753|26-Sep-22|3500| 500|    20|    20|TURNER|    NEW YORK|
|  762|   SAM|MANAGER|753|26-Sep-22|3500| 500|    20|    20|MILLER| LOS ANGELES|
|  796|TURNER|SALSMAN|745|25-Jul-22|3500| 250|    20|    20| ALLEN|     CHICAGO|
|  796|TURNER|SALSMAN|745|25-Jul-22|3500| 250|    20|    20|   SAM| LOS ANGELES|
|  796|TURNER|SALSMAN|745|25-Jul-22|3500| 250|    20|    20|TURNER|    NEW YORK|
+-----+------+-------+---+---------+----+----+------+------+------+------------+
only showing top 20 rows